app/Controllers/Urgtec.php

        public function departamento(){
            $departamento = new \App\Models\DepartamentoModel();
            $data["departamento"] = $departamento->find();
---
SELECT *
FROM `departamento`