app/Controllers/Urgtec.php

SELECT *
FROM `departamento`
INSERT INTO `funcionario` (`nome`, `email`, `data_nascimento`, `sexo`, `departamento`, `status`) VALUES ('Aline', 'li_okay222@hotmail.coma', '1997-05-14', 'masculino', '1', '1')
---
    public function index()
    {
        $departamento = new \App\Models\DepartamentoModel();
        $data["titulo"] =  "Cadastros de Funcionários";
        $data["msg"] = "";
        $data["departamento"] = $departamento->find();
        $data["view"] = "cadastroFuncionario";



           if($this->request->getMethod() === "post"){

                $funcionario = new \App\Models\FuncionarioModel();
                $funcionario->set("nome", $this->request->getPost("nome"));
                $funcionario->set("email", $this->request->getPost("email"));
                $funcionario->set("data_nascimento", $this->request->getPost("data_nascimento"));
                $funcionario->set("sexo", $this->request->getPost("sexo"));
                $funcionario->set("departamento", $this->request->getPost("departamento"));
                $funcionario->set("status", $this->request->getPost("status"));
                if($funcionario->insert()):

SELECT *
FROM `departamento`
INSERT INTO `departamento` (`nome_departamento`) VALUES ('Cozinha')
---
        public function departamento(){
            $departamento = new \App\Models\DepartamentoModel();
            $data["departamento"] = $departamento->find();
            $data["titulo"] =  "Adicionar Departamento";
            $data["msg"] = "";
            $data["view"] = "cadastroDepartamento";


            if($this->request->getMethod() === "post"):
                $departamento = new \App\Models\DepartamentoModel();
                $departamento->set("nome_departamento", $this->request->getPost("nome_departamento"));
                  if($departamento->insert()):